10/1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 50 0);

boundaryField
{
    inlet_s
    {
	type		fixedValue;
	value		uniform (0 50 0);
    }

    inlet
    {
	type		fixedValue;
	value		uniform (0 50 0);
    }

    up_down
    {
        type            slip;
    }

    outlet
    {
        type            zeroGradient;
    }

    inner
    {
	type		slip;

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
