10/1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet_s
    {
        type            patch;
        nFaces          40;
        startFace       39620;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       39660;
    }
    up_down
    {
        type            patch;
        nFaces          300;
        startFace       39700;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       40000;
    }
    inner
    {
        type            patch;
        nFaces          31;
        startFace       40080;
    }
    defaultFaces
    {
        type            empty;
        nFaces          53154;
        startFace       40111;
    }
)

// ************************************************************************* //
