10/1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.00005;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //


functions
{
  

scalar1
{
    type            scalarTransport;
    libs            ("libsolverFunctionObjects.so");
    // Optional entries
    // Name of scalar field to transport, default = 's'
    field           s;
  
    phi             phi; // Name of flux field, default = 'phi'
    
    rho             rho; // Name of density field for compressible cases, default = 'rho'
    
    phase           none; // Name of phase field to constrain scalar to, default = 'none'

    // Set the scalar to zero on start/re-start
    resetOnStartUp  no;

    // Name of field to use when looking up schemes from fvSchemes
    // default = <field>
    schemesField    U; //U;

    diffusion viscosity; //constant; //none;

     Diffusivity
  alphal    1;
  alphat    1;

    // Fixed value diffusivity
    D               0.0;

    // Name of field to use as diffusivity, default = 'none'
    // nut             none;

    // Run-time selectable sources
}
  
}